/*
    Author : Lisemara
    Date   : 21-05-22
    Page   : 82
    Summary: 진법을 이해하기 위해 푸는 문제입니다.

*/

#include <stdio.h>

// 
int main(void){
    printf("10진수 8부터 20까지 2진수와 16진수로 표현해보기\n");
    printf("10진수 08 : 1000(2), 8(16)\n");
    printf("10진수 09 : 1001(2), 9(16)\n");
    printf("10진수 10 : 1010(2), A(16)\n");
    printf("10진수 11 : 1011(2), B(16)\n");
    printf("10진수 12 : 1100(2), C(16)\n");
    printf("10진수 13 : 1101(2), D(16)\n");
    printf("10진수 14 : 1110(2), E(16)\n");
    printf("10진수 15 : 1111(2), F(16)\n");
    printf("10진수 16 : 10000(2), 10(16)\n");
    printf("10진수 17 : 10001(2), 11(16)\n");
    printf("10진수 18 : 10010(2), 12(16)\n");
    printf("10진수 19 : 10011(2), 13(16)\n");
    printf("10진수 20 : 10100(2), 14(16)");
    return 0;
}